tap "alexanderwillner/tap"
tap "federico-terzi/espanso"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU grep, egrep and fgrep
brew "grep"
# Mac App Store command-line interface
brew "mas"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# NCurses Disk Usage
brew "ncdu"
# Platform built on V8 to build network applications
brew "node"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Version control system designed to be a better CVS
brew "subversion"
# Vi 'workalike' with many additional features
brew "vim"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
# Simple read-only comand-line interface to your Things 3 database
brew "alexanderwillner/tap/things.sh"
# Cross-platform Text Expander written in Rust
brew "federico-terzi/espanso/espanso"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Memory training application
cask "anki"
# Menu bar calendar for events and reminders
cask "calendar-366"
# Clipboard extension app
cask "clipy"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Voice and text chat software
cask "discord"
# Metadata cleaner
cask "exifcleaner"
# Web browser
cask "firefox"
# Client for the Google Drive storage service
cask "google-drive"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Software for Logitech devices
cask "logitech-options"
# Timer application
cask "michaelvillar-timer"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Presentation software
cask "microsoft-powerpoint"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Word processor
cask "microsoft-word"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collection of apps available by subscription
cask "setapp"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# General-purpose text editor
cask "textmate"
# Enable and disable the Intel CPU Turbo Boost feature
cask "turbo-boost-switcher"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organize, cite, and share research sources
cask "zotero"
mas "Drafts", id: 1435957248
mas "Magnet", id: 441258766
mas "Spark", id: 1176895641
mas "Things", id: 904280696
